Revit.Elements.SunSettings.SunDirection
Calculates the direction of the sun.

Revit.Elements.SunSettings.Altitude
Extracts the Altitude.

Revit.Elements.SunSettings.Azimuth
Extracts the Azimuth.

Revit.Elements.SunSettings.StartDateTime
Gets the Start Date and Time of the solar study.

Revit.Elements.SunSettings.EndDateTime
Gets the End Date and Time of the solar study.

Revit.Elements.SunSettings.CurrentDateTime
Gets the Date and Time for the current frame of the solar study.